Revit 2027 API
DuctPressureDropData.VelocityPressure Property
 The velocity pressure of the duct. Units: (kg/(ft·s²)).
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double VelocityPressure { get; set; }
Public Property VelocityPressure As Double
	Get
	Set
public:
property double VelocityPressure {
	double get ();
	void set (double value);
}
member VelocityPressure : float with get, set
Property Value
Double
See Also
Reference
DuctPressureDropData Class
Autodesk.Revit.DB.Mechanical Namespace